go_interfaces.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-27 Fri 01:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: Interfaces</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Go" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Go: Interfaces</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0a3d239">1. Interfaces</a></li>
<li><a href="#org2a2ee1d">2. Errors</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0a3d239" class="outline-2">
<h2 id="org0a3d239"><span class="section-number-2">1</span> Interfaces</h2>
<div class="outline-text-2" id="text-1">
<p>
An interface type is defined by a set of methods. A value of interface type can hold any value that implements those methods.
This time we made the greeting feature more generic by defining a function called Greet which takes a param of interface type Namer. Namer is a new interface we defined which only defines one method: Name(). So Greet() will accept as param any value which has a Name() method defined.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> (
        <span style="color: #ffa500;">"fmt"</span>
        <span style="color: #ffa500;">"os"</span>
)

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">User</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        FirstName, LastName string
}

<span style="color: #00ff00; font-weight: bold;">func</span> (u *<span style="color: #00ffff;">User</span>) <span style="color: #00ffff; font-weight: bold;">Name</span>() <span style="color: #00ffff;">string</span> {
        <span style="color: #00ff00; font-weight: bold;">return</span> fmt.<span style="color: #00ffff; font-weight: bold;">Sprintf</span>(<span style="color: #ffa500;">"%s %s"</span>, u.FirstName, u.LastName)
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Namer</span> <span style="color: #00ff00; font-weight: bold;">interface</span> {
        <span style="color: #00ffff; font-weight: bold;">Name</span>() string
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">Greet</span>(n <span style="color: #00ffff;">Namer</span>) <span style="color: #00ffff;">string</span> {
        <span style="color: #00ff00; font-weight: bold;">return</span> fmt.<span style="color: #00ffff; font-weight: bold;">Sprintf</span>(<span style="color: #ffa500;">"Dear %s"</span>, n.<span style="color: #00ffff; font-weight: bold;">Name</span>())
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Reader</span> <span style="color: #00ff00; font-weight: bold;">interface</span> {
        <span style="color: #00ffff; font-weight: bold;">Read</span>(b []<span style="color: #00ffff;">byte</span>) (n int, err error)
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Writer</span> <span style="color: #00ff00; font-weight: bold;">interface</span> {
        <span style="color: #00ffff; font-weight: bold;">Write</span>(b []<span style="color: #00ffff;">byte</span>) (n int, err error)
}

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">ReadWriter</span> <span style="color: #00ff00; font-weight: bold;">interface</span> {
        Reader
        Writer
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        u := &amp;<span style="color: #00ffff;">User</span>{<span style="color: #ffa500;">"Pavel"</span>, <span style="color: #ffa500;">"Vavilin"</span>}
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #00ffff; font-weight: bold;">Greet</span>(u))

        <span style="color: #00ff00; font-weight: bold;">var</span> w Writer
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">os.Stdout implements Writer</span>
        w = os.Stdout
        fmt.<span style="color: #00ffff; font-weight: bold;">Fprintf</span>(w, <span style="color: #ffa500;">"hello, writer\n"</span>)
}
</pre>
</div>

<pre class="example">
Dear Pavel Vavilin
hello, writer

</pre>
</div>
</div>

<div id="outline-container-org2a2ee1d" class="outline-2">
<h2 id="org2a2ee1d"><span class="section-number-2">2</span> Errors</h2>
<div class="outline-text-2" id="text-2">
<p>
An error is anything that can describe itself as an error string. The idea is captured by the predefined, built-in interface type, error, with its single method, <b>Error</b>, returning a string:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">error</span> <span style="color: #00ff00; font-weight: bold;">interface</span> {
        <span style="color: #00ffff; font-weight: bold;">Error</span>() string
}
</pre>
</div>
<p>
The <b>fmt</b> package’s various print routines automatically know to call the method when asked to print an error.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> (
        <span style="color: #ffa500;">"fmt"</span>
        <span style="color: #ffa500;">"time"</span>
)

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">MyError</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        When time.Time
        What string
}

<span style="color: #00ff00; font-weight: bold;">func</span> (e *<span style="color: #00ffff;">MyError</span>) <span style="color: #00ffff; font-weight: bold;">Error</span>() <span style="color: #00ffff;">string</span> {
        <span style="color: #00ff00; font-weight: bold;">return</span> fmt.<span style="color: #00ffff; font-weight: bold;">Sprintf</span>(<span style="color: #ffa500;">"at %v, %s"</span>, e.When, e.What)
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">run</span>() <span style="color: #00ffff;">error</span> {
        <span style="color: #00ff00; font-weight: bold;">return</span> &amp;<span style="color: #00ffff;">MyError</span>{
                time.<span style="color: #00ffff; font-weight: bold;">Now</span>(),
                <span style="color: #ffa500;">"it didn't work"</span>,
        }
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        <span style="color: #00ff00; font-weight: bold;">if</span> err := <span style="color: #00ffff; font-weight: bold;">run</span>(); err != <span style="color: #7fffd4;">nil</span> {
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(err)
        }
}
</pre>
</div>

<pre class="example">
at 2017-10-27 01:08:06.463604058 +1000 +10, it didn't work

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-27 Fri 01:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
